package view.constants;


public class MainConstants {
    public static final String AUTHORS[] = {
         "Laura Tobon Ospina,", 
         "Juan David Arismendy Pulgarin" };
    
    public static final String SUBTITLE="Trabajo realizado por: ";

    public static final String MAIN_MENU_OPTIONS[] = {
         "[~] Seleccione alguna opcion!", 
         "[1] - Ingresar polinomio.",
         "[2] - Mostrar polinomios.", 
         "[3] - Multiplicar polinomio.", 
         "[4] - Dividir polinomio.",
         "[5] - Evaluar polinomio.", 
         "[.] - Salir." };

    public static final String ERROR = 
        "[!] Ingrese una opcion correcta!";

        
    public static final String LOGO = """
        ██████╗░░█████╗░██╗░░░░░██╗███╗░░██╗░█████╗░███╗░░░███╗██╗░█████╗░░██████╗
        ██╔══██╗██╔══██╗██║░░░░░██║████╗░██║██╔══██╗████╗░████║██║██╔══██╗██╔════╝
        ██████╔╝██║░░██║██║░░░░░██║██╔██╗██║██║░░██║██╔████╔██║██║██║░░██║╚█████╗░
        ██╔═══╝░██║░░██║██║░░░░░██║██║╚████║██║░░██║██║╚██╔╝██║██║██║░░██║░╚═══██╗
        ██║░░░░░╚█████╔╝███████╗██║██║░╚███║╚█████╔╝██║░╚═╝░██║██║╚█████╔╝██████╔╝
        ╚═╝░░░░░░╚════╝░╚══════╝╚═╝╚═╝░░╚══╝░╚════╝░╚═╝░░░░░╚═╝╚═╝░╚════╝░╚═════╝░""";

    public static final String LOGO2 = """
        🅿 🅾 🅻 🅸 🅽 🅾 🅼 🅸 🅾 🆂""";
        
    public static final String LOGO3 = """
    █▀█ █▀█ █   █ █▄ █ █▀█ █▀▄▀█ █ █▀█ █▀
    █▀▀ █▄█ █▄▄ █ █ ▀█ █▄█ █░▀░█ █ █▄█ ▄█
    """;


}
